app/controllers/admin/categories_controller.rb

  def create
    @category = Category.new(category_params)
    if @category.save
---
INSERT INTO "categories" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "Ruby"], ["created_at", "2015-11-25 13:31:19.020724"], ["updated_at", "2015-11-25 13:31:19.020724"]]

  def update
    if @category.update(category_params)
---
UPDATE "categories" SET "title" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["title", "The Beatles"], ["updated_at", "2015-11-25 20:35:40.799712"], ["id", 10]]