app/controllers/admin/users_controller.rb

  def destroy
    @user = User.find(params[:id])
    @user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 3]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]