app/views/posts/_category_list.html.erb

<% unless post.categories.empty? %>
---
SELECT  1 AS one FROM "categories" INNER JOIN "categories_posts" ON "categories"."id" = "categories_posts"."category_id" WHERE "categories_posts"."post_id" = ? AND "categories"."id" = ? LIMIT 1  [["post_id", 1], ["id", 5]]
SELECT "categories".* FROM "categories" INNER JOIN "categories_posts" ON "categories"."id" = "categories_posts"."category_id" WHERE "categories_posts"."post_id" = ?  [["post_id", 2]]