app/controllers/categories_controller.rb

INSERT INTO "categories" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "Транспорт"], ["created_at", "2015-11-04 17:16:20.901300"], ["updated_at", "2015-11-04 17:16:20.901300"]]
---
  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save

UPDATE "categories" SET "title" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["title", "Транспорт Москвы"], ["updated_at", "2015-11-04 19:05:15.125972"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @category.update(category_params)

SELECT  1 AS one FROM "categories" INNER JOIN "categories_posts" ON "categories"."id" = "categories_posts"."category_id" WHERE "categories_posts"."post_id" = ? AND "categories"."id" = ? LIMIT 1  [["post_id", 1], ["id", 5]]
SELECT "categories".* FROM "categories" INNER JOIN "categories_posts" ON "categories"."id" = "categories_posts"."category_id" WHERE "categories_posts"."post_id" = ?  [["post_id", 16]]
SELECT "posts".* FROM "posts" INNER JOIN "categories_posts" ON "posts"."id" = "categories_posts"."post_id" WHERE "categories_posts"."category_id" = ?  [["category_id", 8]]
---
  def show
    @posts = Post.select {|post| post.categories.include?(@category)}