app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 22]]
INSERT INTO "comments" ("body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "Great performance of this song is staged in Stas Namin's Beatlemania show."], ["post_id", 3], ["created_at", "2015-11-07 02:06:36.453266"], ["updated_at", "2015-11-07 02:06:36.453266"]]
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.new(comment_params)
    @comment.user = current_user
    if @comment.save

UPDATE "comments" SET "body" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["body", "EFGHIH"], ["updated_at", "2015-11-26 13:17:48.523761"], ["id", 44]]
---
  def update
    abort_if_non_authorized(@comment)
    if @comment.update(comment_params)

DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 35]]
---
  def destroy
    abort_if_non_authorized(@comment)
    @comment.destroy