app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."published" = ?  [["published", "f"]]
SELECT "posts".* FROM "posts" WHERE "posts"."published" = ? AND "posts"."user_id" = ?  [["published", "f"], ["user_id", 1]]
---
  def unpublished
    if under_admin?
      @posts = Post.unpublished.all
    else
      @posts = Post.unpublished.authored_by(current_user).all