app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."published" = ?  ORDER BY "posts"."created_at" DESC  [["published", "t"]]
---
  def index
    @posts = Post.published.by_creation_desc.all

SELECT "posts".* FROM "posts" WHERE "posts"."pending" = ? AND "posts"."user_id" = ?  ORDER BY "posts"."created_at" DESC  [["pending", "t"], ["user_id", 7]]
---
  def pending
    @posts = Post.pending.by_creation_desc
    @posts = @posts.authored_by(current_user) unless under_admin?
    @posts = @posts.all

INSERT INTO "posts" ("title", "body", "pending", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Привет, модератор!"], ["body", "Здесь что-то нецензурное."], ["pending", "t"], ["user_id", 1], ["created_at", "2015-11-21 15:11:03.060218"], ["updated_at", "2015-11-21 15:11:03.060218"]]
---
  def create
    @post = Post.new(post_params)
    @post.subscribers << current_user

UPDATE "posts" SET "pending" = ?, "published" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["pending", "t"], ["published", "f"], ["updated_at", "2015-11-21 16:11:08.888688"], ["id", 21]]
---
  def update
    abort_if_not_authorized(@post)
    if params[:publish]
      @post.pending = true
      @post.published = false
      notice = 'Измененная публикация станет доступна другим пользователям после модерации.'
    elsif params[:draft] && (@post.published || @post.pending)
      @post.published = false
      @post.pending = false
      notice = 'Публикация сохранена в черновиках и не будет доступна другим пользователям.'
    else
      notice = 'Черновик публикации успешно обновлен.'
    end
    if @post.update(post_params)

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 34]]
---
  def destroy
    abort_if_not_authorized(@post)
    @post.destroy